{
  "menu": {
    "map": "Suivi de Carte",
    "script": "Scripts Javascript",
    "combat": "Stratégies de Combat",
    "tcg": "Stratégies TCG"
  },
  "button": {
    "ok": "OK",
    "cancel": "Annuler",
    "refresh": "Actualiser la Page",
    "help": "Voir l'Aide",
    "all": "Tout",
    "subscribed": "Abonné",
    "visitOnline": "Visiter le Dépôt en Ligne"
  },
  "sider": {
    "repoTitle": "Dépôt de Scripts",
    "mainRepo": "Visiter le Dépôt Principal BetterGI",
    "scriptRepo": "Visiter le Dépôt de Scripts BetterGI",
    "onlineRepo": "Visiter le Dépôt en Ligne",
    "otherExtensions": "Autres Extensions",
    "lastUpdate": "Dernière Mise à Jour : ",
    "document": "Consultez la documentation officielle"
  },
  "script": {
    "all": "Tout",
    "subscribed": "Abonné",
    "onlyLocal": "Disponible uniquement en mode local",
    "searchMap": "Rechercher nom de ressource, auteur, tag",
    "searchScript": "Entrer des mots-clés pour rechercher",
    "searchCombat": "Entrer des mots-clés pour rechercher",
    "searchTCG": "Entrer des mots-clés pour rechercher",
    "searchDefault": "Entrer des mots-clés pour rechercher",
    "author": "Auteur : ",
    "noAuthor": "Anonyme",
    "unknown": "Script Inconnu"
  },
  "error": {
    "repoTitle": "Échec de récupération des informations du dépôt",
    "repoDesc": "Vérifiez votre réseau ou actualisez la page plus tard"
  },
  "comment": {
    "title": "Commentaires",
    "localModeTitle": "Les commentaires ne sont pas pris en charge en mode local",
    "localModeDesc": "Veuillez visiter le dépôt en ligne pour les commentaires"
  },
  "egg": {
    "title": "Easter Egg",
    "loading": "L'easter egg fait de son mieux pour charger...",
    "error": "Échec du chargement malgré tous les efforts, veuillez réessayer"
  },
  "plan": {
    "title": "Plan de Mise à Jour",
    "desc": "Voici quelques plans de mise à jour futurs. Toutes les contributions ou aides pour leur mise en œuvre sont les bienvenues. Pour le moment, je suis le seul auteur, donc la vitesse de mise à jour ne sera pas très rapide. Merci de votre compréhension !",
    "link": "URL du Dépôt : https://github.com/zaodonganqi/bettergi-script-web",
    "author": "Email de l'Auteur : anqi4051{'@'}gmail.com",
    "planList": [
      {
        "desc": "Support des Couleurs de Thème",
        "content": "Plus de couleurs de thème (très simple, en espérant que les développeurs qui veulent aider créeront des couleurs de thème) et des popups de gestion dédiés, supportant les thèmes translucides et les thèmes personnalisés (stockage de la configuration des couleurs de thème json via le formulaire js du dépôt et obtention, cache local stockant l'utilisation actuelle), supportant les images d'arrière-plan personnalisées en mode translucide."
      },
      {
        "desc": "Renforcer l'Abonnement en un Clic",
        "content": "Trouvez les scripts que vous avez déjà abonnés parmi les scripts mis à jour pour filtrer ceux qui peuvent être mis à jour en un clic. Bien sûr, mettre à jour tous les scripts aveuglément n'est pas très lent de toute façon."
      },
      {
        "desc": "Ajouter une Documentation de Tutoriel Interne (Résolu, peut être consulté dans la documentation officielle)",
        "content": "Ajoutez un tutoriel d'utilisation du dépôt dans la barre d'outils pour les novices en informatique."
      },
      {
        "desc": "Tri et Filtrage Plus Complets",
        "content": "Le tri et le filtrage actuels utilisent le menu déroulant fourni par antd, mais de nombreux problèmes ont été constatés lors de l'utilisation réelle. Pour améliorer le tri et le filtrage, la première étape consiste à refactoriser le menu déroulant, en utilisant d'autres composants ou en l'implémentant vous-même. Actuellement, a-popover est envisagé pour le remplacer. Deuxièmement, la fonction de filtrage doit fournir un support de filtrage par auteur, et le filtrage par rôle doit également ajouter des méthodes d'exclusion. Pour plus d'intuitivité, le filtrage par rôle doit envisager d'ajouter des avatars de personnages."
      },
      {
        "desc": "Recherche Plus Puissante",
        "content": "Améliorez la fonction de recherche. La recherche actuelle n'est qu'une détection de mots-clés ; une correspondance approximative doit être envisagée (cet élément a une faible priorité, car c'est beaucoup d'effort pour peu de résultats)."
      },
      {
        "desc": "Animations Plus Avancées",
        "content": "Fournissez plus d'effets d'animation pour les interactions de l'interface utilisateur."
      },
      {
        "desc": "Améliorer la Liste des Scripts Mis à Jour",
        "content": "Ajoutez un mécanisme de type routage (mais pas un routage réel) à la page, permettant de naviguer par un clic dans la vue des mises à jour."
      },
      {
        "desc": "Confidence de l'Auteur",
        "content": "Je n'écrirai pas la confidence dans le titre, héhé ! Actuellement, l'auteur est assez occupé à jongler avec des projets personnels, des études et du travail. S'il vous plaît, ne me blâmez pas pour les mises à jour lentes, wuwuwu. La meilleure façon de me pousser à mettre à jour est de sponsoriser l'auteur ou de donner une étoile à cet humble auteur (si vous ne savez pas ce qu'est une étoile, oubliez ça)."
      }
    ]
  },
  "help": {
    "title": "FAQ Q&A",
    "modalTitle": "Note : Toute question doit être réfléchie ou documentée avant d'être posée",
    "author": "Email de l'auteur : anqi4051{'@'}gmail.com",
    "qa": [
      {
        "q": "Pourquoi le dépôt échoue-t-il toujours à charger ? (Uniquement pour le dépôt en ligne)",
        "a": "Le dépôt utilise des adresses GitHub, et les connexions directes depuis la Chine peuvent être intermittentes, ce qui est normal. Si cela ne s'ouvre pas, essayez plusieurs fois ou revenez dans quelques minutes. Vous pouvez aussi utiliser la page de dépôt local de BGI. (Si vous êtes un magicien, vous savez quoi faire)"
      },
      {
        "q": "Tutoriel d'utilisation du dépôt ?",
        "a": "Voir le site officiel de BGI : Manuel de l'utilisateur - Dépôt de scripts."
      },
      {
        "q": "Les scripts abonnés se mettent-ils à jour automatiquement ?",
        "a": "Non. Le processus d'abonnement à un script consiste essentiellement à copier un fichier ou un dossier dans un autre dossier. Après chaque mise à jour du dépôt, ce qui est mis à jour est le dépôt central qui stocke tous les fichiers du dépôt localement. Vous devez vous réabonner manuellement aux scripts qui ont des mises à jour pour réaliser la mise à jour (pour plus de détails, voir le site officiel de BGI : Manuel de l'utilisateur - Fichiers locaux)."
      },
      {
        "q": "Pourquoi la mise à jour récente disparaît-elle la prochaine fois que je l'ouvre ?",
        "a": "Limité par la méthode actuelle d'acquisition de données, après avoir cliqué sur un script avec une notification de mise à jour ou effacé le point rouge, il sera marqué comme non mis à jour. Cela pourra être résolu à l'avenir."
      },
      {
        "q": "La mise à jour en un clic ne peut-elle mettre à jour que ceux avec des mises à jour ou me laisser choisir ?",
        "a": "Il y a deux raisons : 1 est la même que la question précédente sur les mises à jour récentes, 2 est que l'auteur (moi) n'a pas eu le temps de l'implémenter récemment."
      },
      {
        "q": "Pourquoi la fonction de commentaire n'est-elle pas disponible ?",
        "a": "Les commentaires ne sont pas pris en charge en mode local. Veuillez visiter le dépôt en ligne et vous connecter à votre compte GitHub pour commenter. Comment utiliser GitHub doit être résolu par vous-même."
      },
      {
        "q": "Pourquoi n'y a-t-il pas de script XX ?",
        "a": "Utilisez bien la recherche. Lors de la recherche, essayez de vous assurer que les mots-clés sont précis, comme \"Fleur Douce\", ou si vous ne trouvez pas \"coupe de bois\", essayez de rechercher \"couper des arbres\". Si vous ne le trouvez toujours pas après avoir tout cherché, alors aucun auteur ne l'a écrit. Vous pouvez essayer d'en écrire un vous-même."
      },
      {
        "q": "Qu'est-ce que README, pourquoi a-t-il échoué à charger ? Pourquoi n'est-il pas affiché ?",
        "a": "Lisez d'abord README vous-même, comprenez-vous ? L'échec de chargement est le même que la première question. Il n'est pas affiché car il n'y a pas de fichier README.md dans ce répertoire."
      },
      {
        "q": "Pourquoi certains liens ne peuvent-ils pas être cliqués ? Pourquoi cela charge-t-il longtemps sans charger ?",
        "a": "Même que la première question."
      },
      {
        "q": "Pourquoi n'y a-t-il pas de réponse après avoir cliqué sur s'abonner ?",
        "a": "Veuillez ouvrir BGI, une fenêtre d'importation apparaîtra, sélectionnez importer. Si vous utilisez le dépôt en ligne et que le script auquel vous vous êtes abonné n'apparaît pas après avoir actualisé la page BGI, mettez à jour le dépôt local et réessayez. S'il y a encore des problèmes, demandez dans le groupe pertinent."
      },
      {
        "q": "Que faire si ce script ne fonctionne pas ?",
        "a": "Veuillez demander dans le groupe pertinent, les problèmes spécifiques nécessitent une analyse spécifique. Lors de la demande, assurez-vous que vos captures d'écran et descriptions sont suffisantes."
      },
      {
        "q": "Pourquoi mes commentaires précédents ont-ils disparu ?",
        "a": "Les commentaires ne sont généralement pas supprimés. Si les commentaires disparaissent, il est probable que le chemin du nœud sur lequel vous avez commenté ait changé. Par exemple, si le répertoire Crystal Ore a été renommé en Crystal Water Ore, vous verrez une nouvelle section de commentaires."
      },
      {
        "q": "Pourquoi ce script n'utilise-t-il pas Nahida ?",
        "a": "Les auteurs doivent considérer si tout le monde l'a. Si nécessaire, essayez d'en faire un vous-même."
      },
      {
        "q": "Que faire si je veux la fonction XX ?",
        "a": "Si aucun auteur ne l'a écrit, écrivez-en un vous-même !"
      },
      {
        "q": "Autres",
        "a": "S'il y a encore des questions, veuillez d'abord chercher sur le site officiel. Si vous ne trouvez ni sur le site officiel ni ici, veuillez me contacter."
      }
    ]
  },
  "readmeViewer": {
    "descTitle": "Description : ",
    "noDesc": "Aucune description",
    "loadTimeout": "Délai d'attente de chargement",
    "loadFailed": "Échec du chargement",
    "clickToViewFile": "Cliquez pour voir le fichier dans le dépôt GitHub",
    "clickToViewDir": "Cliquez pour voir le répertoire dans le dépôt GitHub",
    "invalidLinkHint": "(Cet auteur est stupide et a mal écrit le lien, allez lui rappeler de le corriger)",
    "iframeNotice": "En raison des restrictions de sécurité, ce contenu ne peut pas être affiché directement. Veuillez utiliser le dépôt local pour le visualiser"
  },
  "action": {
    "help": "Aide",
    "jumpToGitHub": "GitHub",
    "comment": "Commentaire",
    "subscribe": "Mise à jour en un clic",
    "update": "Vérifier les mises à jour",
    "plan": "Plan de mise à jour",
    "announcement": "Annonce",
    "recent": "Mises à jour récentes",
    "updateAll": "Mettre à jour tous les abonnements ?",
    "clearDot": "Effacer le point rouge",
    "subscribed": "Abonné",
    "confirm": "Confirmer",
    "cancel": "Annuler"
  },
  "mapTreeList": {
    "subscribed": "Abonné",
    "subscribe": "S'abonner",
    "subscribeAgain": "S'abonner à nouveau",
    "selectValidNode": "Veuillez sélectionner un nœud valide pour s'abonner",
    "subscribeFailed": "Échec de l'abonnement",
    "subscribeFailedWithMsg": "Échec de l'abonnement : {msg}",
    "subscribeSuccess": "Le lien d'abonnement pour {name} a été copié dans le presse-papiers",
    "copyFailed": "Échec de la copie du lien d'abonnement pour {name}",
    "noDesc": "Aucun"
  },
  "scriptList": {
    "hasUpdate": "Mise à jour disponible",
    "subscribed": "Abonné",
    "noAuthor": "Anonyme"
  },
  "combatStrategyList": {
    "hasUpdate": "Mise à jour disponible",
    "subscribed": "Abonné",
    "noAuthor": "Anonyme"
  },
  "cardStrategyList": {
    "hasUpdate": "Mise à jour disponible",
    "subscribed": "Abonné",
    "noAuthor": "Anonyme"
  },
  "common": {
    "comma": ", ",
    "noDesc": "Aucune description",
    "reset": "Réinitialiser",
    "confirm": "Confirmer"
  },
  "detail": {
    "author": "Auteur : ",
    "scriptAuthor": "Auteur",
    "noAuthor": "Anonyme",
    "subscribe": "S'abonner",
    "subscribed": "Abonné",
    "subscribeAgain": "S'abonner à nouveau",
    "subscribeFailed": "Échec de l'abonnement",
    "subscribeFailedWithMsg": "Échec de l'abonnement : {msg}",
    "subscribeSuccess": "Le lien d'abonnement pour {name} a été copié dans le presse-papiers",
    "copyFailed": "Échec de la copie du lien d'abonnement pour {name}",
    "loadingReadme": "Chargement du fichier readme",
    "readmeFailed": "Échec du chargement du fichier readme, veuillez réessayer",
    "loadingStrategy": "Chargement du contenu du fichier de stratégie",
    "strategyFailed": "Échec du chargement du fichier de stratégie, veuillez réessayer",
    "empty": "Veuillez sélectionner un script à gauche pour voir les détails",
    "desc": "Description : ",
    "tabReadme": "Description",
    "tabFiles": "Liste des Fichiers",
    "noFiles": "Aucune donnée de fichier",
    "modalTitle": "Détails du Fichier",
    "name": "Nom",
    "tags": "Tags",
    "lastUpdated": "Dernière Mise à Jour",
    "operations": "Opérations",
    "hash": "Hash",
    "description": "Description",
    "version": "Version",
    "path": "Chemin",
    "details": "Détails",
    "showDetails": "Détails"
  },
  "settings": {
    "title": "Paramètres",
    "language": "Sélectionner la Langue",
    "zhCN": "Chinois Simplifié",
    "zhTW": "Chinois Traditionnel",
    "enUS": "Anglais",
    "jaJP": "Japonais",
    "frFR": "Français",
    "theme": "Définir le Thème",
    "eggSafetyTitle": "Avis de Sécurité",
    "eggSafetyDesc": "Attention : L'effet easter-egg à venir contient des clignotements rapides, des contrastes forts et des couleurs dynamiques très saturées qui peuvent déclencher une épilepsie photosensible ou causer de l'inconfort. Si vous ou quelqu'un autour de vous avez des antécédents d'épilepsie photosensible, êtes sensibles au clignotement/lumière forte, ou êtes fatigués ou sous l'influence de l'alcool, veuillez annuler et éviter de regarder.",
    "eggSafetyOk": "Je comprends, continuer",
    "eggSafetyCancel": "Annuler",
    "clearUpdate": "Effacer les Notifications de Mise à Jour",
    "clearUpdateBtn": "Effacer",
    "clearUpdateSuccess": "Notifications de mise à jour effacées avec succès",
    "clearUpdateFailed": "Échec de l'effacement des notifications de mise à jour",
    "uploadBackground": "Télécharger l'arrière-plan",
    "customBackgroundSaved": "Arrière-plan personnalisé sauvegardé avec succès",
    "customBackgroundSaveFailed": "Échec de la sauvegarde de l'arrière-plan personnalisé",
    "customBackgroundCleared": "Arrière-plan personnalisé effacé",
    "customBackgroundClearFailed": "Échec de l'effacement de l'arrière-plan personnalisé",
    "invalidImageFile": "Veuillez sélectionner un fichier image valide",
    "imageFileTooLarge": "Fichier image trop volumineux, veuillez sélectionner un fichier de moins de 50MB",
    "fileUploadFailed": "Échec du téléchargement du fichier",
    "guide": "Guide",
    "startGuide": "Démarrer le guide"
  },
  "guide": {
    "step1Title": "Obtenir de l’aide",
    "step1Desc": "En cas de problème, commencez par consulter ici pour trouver une solution.",
    "step2Title": "Paramètres",
    "step2Desc": "Configurez ici les paramètres de base de la page.",
    "step3Title": "Choisir une catégorie",
    "step3Desc": "Cliquez sur un élément du menu à gauche (exemple : scripts JavaScript).",
    "step4Title": "S’abonner au script",
    "step4Desc": "Cliquez pour vous abonner au script.<br>Attention !<br>La mise à jour du dépôt ici ne fait qu’actualiser les informations de votre dépôt central local.<br>Elle ne met PAS automatiquement à jour les scripts ou chemins auxquels vous êtes déjà abonné !<br>C’est une erreur fréquente chez les débutants !",
    "step5Title": "Choisir un script",
    "step5Desc": "Cliquez sur un script dans la liste pour afficher ses informations détaillées.",
    "step6Title": "Détails du script",
    "step6Desc": "Le texte ici (s’il existe) est le guide d’utilisation rédigé par l’auteur du script.<br><br><strong>Afin d’éviter tout problème lors de l’exécution :</strong><br><strong style='color:var(--text-error)'>Lisez attentivement toutes les instructions avant d’utiliser un script pour bien comprendre ses fonctionnalités !</strong><br>Poser des questions sans avoir lu la documentation peut donner le mauvais exemple.",
    "next": "Suivant",
    "prev": "Précédent",
    "skip": "Passer",
    "done": "Terminer"
  },
  "sort": {
    "sortBy": "Trier par",
    "sortOrder": "Ordre de tri",
    "relevance": "Pertinence",
    "random": "Aléatoire",
    "time": "Temps",
    "name": "Nom",
    "ascending": "Croissant",
    "descending": "Décroissant",
    "filterByRole": "Filtrer par rôle",
    "searchRole": "Rechercher des rôles",
    "filter": "Filtrer",
    "selected": "Sélectionné :"
  },
  "announcement": {
    "guide": "Guide d'utilisation",
    "changelog": "Journal des modifications",
    "ask": "Comment poser une question"
  },
  "loading": {
    "repoData": "Chargement des données du dépôt, veuillez patienter..."
  },
  "repoError.title": "Échec de récupération des informations du dépôt",
  "repoError.desc": "Vérifiez votre réseau ou actualisez la page plus tard",
  "repoError.refresh": "Actualiser la Page",
  "repoError.help": "Voir l'Aide",
  "script.unknownScript": "Script Inconnu",
  "script.author": "Auteur : ",
  "script.noAuthor": "Anonyme",
  "comment.localModeNoticeTitle": "Les commentaires ne sont pas pris en charge en mode local",
  "comment.localModeNoticeDesc": "Veuillez visiter le dépôt en ligne pour les commentaires",
  "comment.onlineRepo": "Visiter le Dépôt en Ligne",
  "egg.failed": "Échec du chargement malgré tous les efforts, veuillez réessayer",
  "egg.title": "Easter Egg",
  "egg.loading": "L'easter egg fait de son mieux pour charger...",
  "script.searchMap": "Rechercher nom de ressource, auteur, tag",
  "script.onlyLocal": "Disponible uniquement en mode local",
  "comment.title": "Commentaires",
  "script.searchScript": "Rechercher nom de script, auteur, description, tag",
  "script.searchCombat": "Rechercher nom de stratégie de combat, auteur, tag",
  "script.searchTCG": "Rechercher nom de stratégie TCG, auteur, tag",
  "script.searchDefault": "Entrer des mots-clés pour rechercher",
  "update.notice.title": "Avis de mise à jour",
  "update.notice.text": "👀Vous n'avez pas mis à jour le dépôt depuis <b>{day}</b> jours.\nPour profiter de toutes les fonctionnalités et d'une meilleure expérience😉\nAllez le mettre à jour et revenez~",
  "update.notice.tip": "💡 La mise à jour du dépôt n’actualise pas automatiquement vos abonnements.\n     Consultez la FAQ 3 en haut à droite pour plus de détails."
}
